app/controllers/contacts_controller.rb

	def index
		#Obtiene los contactos que fueron creados por el usuario que tiene la sesión.
		@contacts = Contact.where(" user_id = ?" , current_user.id)
---
SELECT "contacts".* FROM "contacts" WHERE ( user_id = 2)

	def destroy
		@contact.destroy #Destroy elimina el objeto de la base de datos
---
DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 2]]

	def update
		if @contact.update(contact_params)
---
UPDATE "contacts" SET "name" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["name", "Alberto Editado"], ["updated_at", "2017-02-20 06:07:44.022167"], ["id", 2]]